---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpacing
source: html/5d41a620-08ed-e51d-430c-1c4ece82979f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpacing Property

"Bar Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpacing { get; }
```